/* ============================================================
   ShvanTV+ — DATA CENTER
============================================================ */

const userData = {
    name: "شڤان جمال",
    image: "https://i.ibb.co/ZJ7t9yQ/profile.jpg"
};

const heroSlides = [
    {
        id: 1,
        title: "نێچیرڤانێن جەنگێ زڤستانێ",
        poster: "https://i.ibb.co/vx2MmkXm/IMG-2597.jpg",           
        desc: "فلمێ دوبلاجكرى بوزمانێ كوردى..."
    }
];

const movies = [

{
    id: 1,
    title: "نێچیرڤانێن جەنگێ زڤستانێ",
    year: "٢٠١٦",
    genre: " - هەمی فلم - دراما - ئەکشن - سەركێشى",
    rate: "⭐ 6.1",
    poster: "https://i.ibb.co/vx2MmkXm/IMG-2597.jpg",

    /* TWO PART VIDEOS */
    part1: "videos/movie1_part1.mp4",
    part2: "videos/movie1_part2.mp4",

    desc: `
فلمێ دوبلاجكرى بوزمانێ كوردى
نێچيرڤانێن جەنگێ زڤستانێ - 2016
....................................................

ئێریك و جەنگاوەر سارا دەمێ مەزن بوون،
ئێك ژ سوپایێ شاھ ژنا بەفرێ فێريا پێکولادکەن بو ڤەشارتنا قەدەغەکری
وەك شەرکرن ژبو رزگارکرنێ مەرەم خرابیا فێریا و خیشکا رەیڤێنا.

....................................................

👥 ئەكتەر:
كريس هيمسوورث – جيسيكا شاستاين – ئيميلى بلونت – چارليز ثيرون

🎬 دەرهێنەر: سيدريك نيكولا ترويان
⭐ رەيتين: 6.1
🔊 دوبلاج: نوژين ئارت
🎭 جور: دراما – ئەكشن – سەركێشى
`
},

/* FILM 2 */
{
id: 2,
    title: "كه ربه ک ژ خوداوه ندان ",
    year: "2012",
    genre: " ئەکشن-  خەیاڵی -هەمی فلم - سەركێشى",
    rate: "⭐ 5.7",
    poster: "https://i.ibb.co/Mx9fLZV7/photo-2023-02-26-20-01-14.jpg",

    part1: "videos/movie2_part1.mp4",
    part2: "videos/movie2_part2.mp4",

    desc: `
فلمێ دوبلاجكرى بوزمانێ كوردى
كه ربه ک ژ خوداوه ندان 2012
    ...................................................

پێرسیوس روبروی چەندئاستەنگێن توند دبیت بو،رزگارکرنابابێ خو،زیوسی هاتبوگرتن ژلایێ بابێ وێ و برایێ وی هێدزی، کوئەژدەها ژ جیهانا بن عەردی فرێکربون دامروڤاتیی ژناڤ ببەن.
...................................................

ئەکتەر :سام وارثینگتن - لیام نیسن 
دەرهێنەر : جۆناثان لیبسمن
ره يتين : ⭐️ 5.7
دوبلاج : نوژين ئارت
جور : ئه كشن - سه ركيشى - خه يالى`
},
/* FILM 3 */
{
id: 3,
    title: "علادین",
    year: "٢٠١٩",
    genre: "خێزانی - کۆمیدی - -هەمی فلم - سەركێشى",
    rate: "⭐ 6.9",
    poster: "https://i.ibb.co/QjPWfbkg/IMG-2600.jpg",

    part1: "videos/movie3_part1.mp4",

    desc: `
فلمێ دوبلاجكرى بۆ زمانێ كوردى  
علادين - 2019  
...................................................

بـه‌ حسێ کوره‌ کێ دل نه‌رمێ هه‌ژار دکه‌ت دگه‌ل  
( گراند ڤیزه‌ر ) یێ برسی، بو به‌ ده‌سته‌هاتنا ده‌سه‌لاتێ،  
کومه‌لملانێ و فریباوانا چه‌رایه‌ کی دکه‌ن.  
هه‌فیشان بۆ جه‌نگ و رزگارکرنێ ده‌چێت.

...................................................

👥 **ئەکتەر:**  
ویڵ سمیث ، مینا مەسعوود  

🎬 **دەرهێنەر:** گای ریچی  
⭐ **رەیتینگ:** 6.9  
🔊 **دوبلاج:** نوژین ئارت  
🎭 **جور:** هەمی فلم -خێزانی – کۆمیدی – سەركێشى
    `
},
{
id: 4,
    title: "ململانێيا خوداوه ندان",
    year: "2010",
    genre: "خێزانی - کۆمیدی - -هەمی فلم - سەركێشى",
    rate: "⭐ 6.9",
    poster: "https://i.ibb.co/0V66LZ47/photo-2023-02-25-17-27-31.jpg",

    part1: "videos/movie4_part1.mp4",
    part2: "videos/movie4_part2.mp4",

    desc: `
🔥فلمێ دوبلاجكرى بوزمانێ كوردى-بادينى
(ململانێيا خوداوه ندان) 2010🔥
    ...................................................

بـه‌ حسێ کوره‌ کێ دل نه‌رمێ هه‌ژار دکه‌ت دگه‌ل  كورتى:-پێرسیوس کورێ بهێزێ(زیوسی)شەرێ درندێن سەر عەردی دکەت و دا رێکاوان بگریت داکو عەردی داگیرنەکەن.

...................................................

👥 **ئەکتەر:** جور:دراما.اكشن.خه يالى
ده م:96 خوله ك
دوبلاج:كوردى-بادينى 
🎭 **جور:**هەمی فلم - خێزانی – کۆمیدی – سەركێشى
    `
},
{
id: 5,
    title: "شاهێ فارسا لسه رده مێ خيزى",
    year: "2010",
    genre: "خەیاڵی - ئەكشن - -هەمی فلم - سەركێشى",
    rate: "⭐ 6.6",
    poster: "https://i.ibb.co/TM2wkzJY/photo-2023-01-25-19-26-24.jpg",

    part1: "videos/movie5_part1.mp4",
    

    desc: `
    فلمێ دوبلاجكرى بوزمانێ كوردى
شاهێ فارسا لسه رده مێ خيزى
    ...................................................

شاه‍ و شاه‍ژنه كا گه نج پێكولێ دكه ن كه سه كێ خراب براوستينن كو پێكولا دكه ت ژبو داگيركرنا جيهانێ ب خه نجه ره كا جياواز كو ده مى كنترول بكه ت .
...................................................

ئەکتەر:جیک جیلنهال-جیمائارتیرتون
دەرهێنەر:مايک نيويل
ره يتين : ⭐️ 6.6
دوبلاج : نوژين ئارت
جور :هەمی فلم - ئەكشن - سەركێشی - خەیاڵی`
},
{
id: 6,
    title: "خوداوەندێن مسرێ",
    year: "2016",
    genre: "خێزانی - کۆمیدی - -هەمی فلم - سەركێشى",
    rate: "⭐ 5.4",
    poster: "https://i.ibb.co/FLmhxL2d/photo-2025-12-11-03-31-23.jpg",

    part1: "videos/movie6_part1.mp4",
    part2: "videos/movie6_part2.mp4",
    

    desc: `
    فلمێ دوبلاجکری بوزمانێ کوردی
خوداوەندێن مسرێ - 2016
    ...................................................

قاره مانه كێ فانى دگه ل خوداوه ند 
" هوره س " رێك دكه ڤيت دژى "سێت" ئانكو خوداوه ندێن تاريێ و ده ست بسه ر ده ستهه لاتدارێن مسرێ دادگريت و شاهنشينێ وێران دكه ن ....................................................

ئەکتەر:نیکوالی کوستەر-جێراڕد بەتلەر 
دەرهێنەر : ئەلێکس پرویاس
ره يتين : ⭐️ 5.4
جور :هەمی فلم - ئه كشن - سه ركێشى - خه يالى`
},
{
id: 7,
    title: "زێر | Gold 2022",
    year: "2022",
    genre: "خێزانی - کۆمیدی - -هەمی فلم - سەركێشى",
    rate: "⭐ 5.4",
    poster: "https://i.ibb.co/9kTJrtns/photo-2025-06-07-00-13-35.jpg",

    part1: "videos/movie7_part1.mp4",
    part2: "videos/movie7_part2.mp4",
    

    desc: `
    فلمێ دوبلاژکری ژ بۆ زمانێ کوردی زێر | Gold 2022
    ...................................................

كورتييەک :
ده‌مێ دوو زه‌لام پێكۆلا ئاشكەراكرنا مه‌زنترین پارچا زێری دده‌ن و دبینن، دڤێت رێكه‌كێ ببینن ژبۆ كۆلانێ داكو بده‌ست خوڤه‌ بینن." هوره س " رێك دكه ڤيت دژى "سێت" ئانكو خوداوه ندێن تاريێ و ده ست بسه ر ده ستهه لاتدارێن مسرێ دادگريت و شاهنشينێ وێران دكه ن ....................................................

ئەکتەر : زاك ئیفرۆن - ئانسۆنی ھایێس
دەرهێنەر :  ئەنتۆنی ھایێس
نمرە : ⭐️ 5.4
دوبلاج : دهوك تيڤى
بەرگ : نــزار جەمبەلى
جور :هەمی فلم - ئەكشن - سەركێشى - هەستلڤين`
},
{
id: 8,
    title: "ستێرێن ل سه ر ئەردی(٢٠٢٥) sitaare zammen par (2025)",
    year: "2025",
    genre: "خێزانی - کۆمیدی - -هەمی فلم - سەركێشى",
    rate: "⭐ 5.4",
    poster: "https://i.ibb.co/99MBVRXv/photo-2025-09-17-16-46-00.jpg",

    part1: "videos/movie8_part1.mp4",
    part2: "videos/movie8_part2.mp4",
    part3: "videos/movie8_part3.mp4",
    

    desc: `
   فلمێ دوبلاجكرى بو زمانئ كوردى-بادينى: ستێرێن ل سه ر ئەردی(٢٠٢٥) sitaare zammen par (2025)
    ...................................................

 كورتى:- راهينه ره كى باسكتبولى چافئ خوه دده ته وان نه خوشا ئه وين (neurodivergent) هه بيت ئه و خزمه تا وان دكه ت و وان فيرى راهينانين باسكتبولى دكه ت
....................................................
ئه كته ر:ئه مير خان، نه عمان ميسرا،نيخات خان.
ره يتن:6.9 ⭐️
وەلات هندستان
دەم : (١٥٥) خولەک 
بەرهەم : کارێز موڤیز
دوبلاج: كوردى-بادينى
كواليتى:1080p/HD
جور :هەمی فلم - ئەكشن - سەركێشى - هەستلڤين`
},
{
id: 9,
    title: "چه وا ئه ژده هايئ خو په روه رده بكه ين (٢٠٢٥) how to train your dragon (2025) ",
    year: "2025",
    genre: "خێزانی - کۆمیدی - -هەمی فلم - سەركێشى",
    rate: "⭐ 7.8",
    poster: "https://i.ibb.co/2zQNQBF/photo-2025-12-11-04-17-32.jpg",

    part1: "videos/movie9_part1.mp4",
    part2: "videos/movie9_part2.mp4",
    part3: "videos/movie9_part3.mp4",
    

    desc: `
فلمئ دوبلاجكرى بو زمانئ كوردى-بادينى: چه وا ئه ژده هايئ خو په روه رده بكه ين (٢٠٢٥) how to train your dragon (2025)     
...................................................

كورتى:- ل گزيرتا بيرك،كوره كى فايكينگا ب ناڤئ (هيكوپ) دبيته هه ڤالئ ئه ژده هايه كى ب ناڤى (توثليس)، سه رپيچيئ د عادات و تقاليدا دكه ت هتد
....................................................
ئه كته ر: ماسون ثاميس،نيكو پاركر،نيك فروست
ره يتن: 7.8⭐️
سال: 2025
ده م:110 خوله ك
دوبلاج:كوردى-بادينى
كواليتى: 1080p/HD
جور :هەمی فلم - سەركێشى - فانتاسى`
},
{
id: 10,
    title: " گەشتا دارستانێ ",
    year: "2025",
    genre: "خێزانی - کۆمیدی - -هەمی فلم - سەركێشى",
    rate: "⭐ 7.0",
    poster: "https://i.ibb.co/QFgXfr9J/photo-2022-06-05-03-01-36.jpg",

    part1: "videos/movie10_part1.mp4",
    part2: "videos/movie10_part2.mp4",

    

    desc: `
    فلمێ دوبلاكری ژ بۆ زمانێ كوردی-بادينى
 گەشتا دارستانێ (‌2021)🎥
    ...................................................

     کورتی:گەشتا پارکا دیزنیلاند هاتەوەرگێران ب بەلەمەکا بچیک کومەکا گەشتیاران چونە ناڤ دارستانەکێ یا پرە ژ گیانەوەرێن ترسناک و درندە.
    ....................................................
ئەکتەر:دواین جونسون.ئێملی بلونت
دەرهێنەر:جاومی كولیت سیرا
ده‌م:127خوله‌ك
رەیتینگ:7.0⭐️
كواليتى:1080p/HD
دوبلاج:كوردى-بادينىجور :هەمی فلم - سەركێشى - فانتاسى`
},
{
id: 11,
    title: "زەلامێ تەڤنپیرك ١   Spider Man 1",
    year: "2002",
    genre: "خێزانی - کۆمیدی - -هەمی فلم - سەركێشى",
    rate: "⭐ 7.0",
    poster: "https://i.ibb.co/3y7nGxLP/photo-2025-08-17-00-19-40.jpg",

    part1: "videos/movie11_part1.mp4",
    part2: "videos/movie11_part2.mp4",

    

    desc: `
    فلمێ دوبلاكری ژ بۆ زمانێ كوردی-بادينى
زەلامێ تەڤنپیرك ١ (٢٠٠٢) 
Spider Man 1 (2002)
    ...................................................

کورتی:- 
 خوێندکارەک ، ژلایێ تەڤنپیرکەکێ بۆماوەیێ وی دهێتە گوهورین، چەند شیانێن سەیرێن تەڤنپیرکێ لدەف پەیدا دبن ، کو پێتڤیە دژی خرابیێ بکاربینیت.
      ....................................................
ئەکتەر:توبي ماغواير-كيرستن دانست
دەرهێنەر:سام رايمي
ده‌م:121خوله‌ك
رەیتینگ:7.3⭐️
كواليتى:1080p/HD
خەڵات :بەربژێرە بۆ ٢ ئۆسکار ، خودانا ١٦ خەڵات ، و بەربژێرە بۆ٦٠ خەڵاتێن دیتر
زمانێ فیلمی :ئینگلیزى
      دوبلاج:كوردى-بادينىجور :هەمی فلم - سەركێشى - فانتاسى`
},
{
id: 12,
    title: " la principessa",
    year: "2019",
    genre: "  -هەمی فلم - خه‌یالی",
    rate: "⭐ 7.0",
    poster: "https://i.ibb.co/0pGKqzy3/photo-2023-04-27-23-53-31.jpg",

    part1: "videos/movie12_part1.mp4",
    part2: "videos/movie12_part2.mp4",

    

    desc: `
    
🔥🎥فلمێ دوبلاژ كری ژبۆ زمانێ كوردی-بادينى 
🎥🔥la principessa (2019)‌
    ...................................................

كورتى:-
ل زینجیرا ئاشلادا ، ئیسپن و كریستین ده‌ست ب گه‌شته‌كا  ب مه‌ترسی دكه‌ن ژبۆ برایێ  ئیسپن شاشینی و دبێت ژبۆ جیهانێ هه‌موویێ ژی.
      ....................................................
ئەکتەر: ڤێییون ئینگه‌ر ، ئیلی هاربۆ
دەرهێنەر: مایكێل برێین 
ده‌م: 135 خولەک بێ بڕین 
دوبلاژ: کوردی-بادينى
بودجه‌: نه‌دیار
داهات: نه‌دیار
خەلات: نینن‌ 
رەیتین : 6.3⭐️
كواليتى:1080p/HD
`
},
{
id: 13,
    title: "(Alone) بتنێ",
    year: "2020",
    genre: "دراما  -هەمی فلم - هەستلڤين",
    rate: "⭐ 7.0",
    poster: "https://i.ibb.co/1F02DG1/photo-2025-05-05-14-14-02.jpg",

    part1: "videos/movie13_part1.mp4",
    part2: "videos/movie13_part2.mp4",

    

    desc: `
    فلمێ دوبلاژکری ژ بۆ زمانێ کوردی بتنێ | Alone 2020
    ...................................................
کورتییەک :
ئافرەتەکا ژ نوى هەڤژينێ خو ژدەست داى ژلايێ بكوژەكى ڤه دهێته رەفاندن، بتنێ رێكا رزگاربونا وێ ئافرەتێ سروشته كو ل دەمەكى دا ئەو بكوژه هێشتا ب دويڤ وێڤەيه.

....................................................
ئەکتەر : جولیس ویڵکۆکس، ئەتۆنی هێڵد
دەرهێنەر : جۆن ھیامس
نمرە : ⭐️ 6.2
بەرگ : نزار جەمبەلى
دوبلاج : دهوك تيڤى
`
},
{
id: 14,
    title: "دوو درست كريێن خودێ",
    year: "2008",
    genre: "دراما  -هەمی فلم - هەستلڤين",
    rate: "⭐ 7.2",
    poster: "https://i.ibb.co/BVjKL4Cx/photo-2023-06-25-18-54-27.jpg",

    part1: "videos/movie14_part1.mp4",
    part2: "videos/movie14_part2.mp4",

    

    desc: `
فلمێ دوبلاژكرى بوزمانێ كوردى-بادينى
 دوو درست كريێن خودێ ٢٠٠٨🔥
     ...................................................
كورتى:-
تانى ل روژا هەڤژينيا خودا مالا زافاى ب روويدانەكا هاتن و چوونێ دمرن، تانى ژبەر بابێ خو هەڤژينيێ دگەل سورێندەرى دكەت و تانى حەش سورێندەرى ناكەتن بەلێ سورێندەر ب شێوەيەكێ باوەر پێ نەكرى دلێ هەڤژيناخو تانى يێ بوخو دبەت كو چ هەستەكى پێ ناكەت تانى.

....................................................
ئەکتەر : جولیس ویڵکۆکس، ئەتۆنی هێڵد
دەرهێنەر : جۆن ھیامس
نمرە : ⭐️ 6.2
بەرگ : نزار جەمبەلى
دوبلاج : دهوك تيڤى
`
},
{
id: 15,
    title: "شاهنشينا هەسارا مەيمينكان | Kingdom of the Planet of the Apes 2024",
    year: "2008",
    genre: " ئەكشن  -هەمی فلم - سەركێشى",
    rate: "⭐ 7.2",
    poster: "https://i.ibb.co/60rF65nV/photo-2025-04-01-17-55-54.jpg",

    part1: "videos/movie15_part1.mp4",
    part2: "videos/movie15_part2.mp4",
    part3: "videos/movie15_part3.mp4",

    

    desc: `

فلمێ دوبلاجكرى بو زمانێ كوردى-بادينى: شاهنشينا هەسارا مەيمينكان | Kingdom of the Planet of the Apes 2024🔥


....................................................

كورتى:-
پشتى چەندين سالان ژ دەستهەلاتا فەرمانده ” سيزار “ـى مەیمينکەكا گەنج گەشتەكێ ئەنجام دەت کو وەلێدکەت پرسیار ژ هەمى ئەوان تشتان بكەت کو دەربارەی ڕابردووی خۆ فێربويه و بڕیارەكێ بدەت بۆ بەرژەوەنديا داهاتيێ مەیمينكان و مرۆڤایەتی.


....................................................
ئەکتەر : ئۆوین تیگ - فرێیا ئاڵن 
دەرهێنەر : وێس باڵ
نمره : ⭐️ 6.9
به رهه م: دژوار سه عيد
دوبلاج : كوردى-بادينى
جور : ئەكشن - سەركێشى -  
كواليتى:1080p/HD
`
},
{
id: 16,
    title: "ئاخڤتنكەرێن باى",
    year: "..",
    genre: " ئەكشن  -هەمی فلم - دراما - جەنگ",
    rate: "⭐ 7.2",
    poster: "https://i.ibb.co/kgY7Zs33/photo-2024-11-27-12-01-06.jpg",

    part1: "videos/movie16_part1.mp4",
    part2: "videos/movie16_part2.mp4",
    

    

    desc: `

فلمێ دوبلاج كری بو زمانێ كوردی ئاخڤتنكەرێن باى

....................................................
كورتيەک :
دوو سەربازێن دەريايا ئەمريكا ل جەنگێ جيهانى يێ دوويێ دا ئەركێ پاراستنا هێزا دەريايێ ” ناڤاجو “ پێ دهێتەدان كو زمانێ دەيكێ وەکى كودەكێ راديويێ يێ نەشكەستى بكاردئينن.
....................................................
ئەکتەر : نیکۆلاس کەیج ، ئادەم بیچ
دەرهێنەر : جۆن وۆ
نمره : ⭐️ 6.1
بەرگ : نزار جەمبەلى
`
},
{
id: 17,
    title: "venom 3 | ڤێنۆم 3",
    year: "..",
    genre: " ئەكشن  -هەمی فلم -",
    rate: "⭐ 7.2",
    poster: "https://i.ibb.co/SwD7kg2B/photo-2025-01-09-00-11-37.jpg",

    part1: "videos/movie17_part1.mp4",
    part2: "videos/movie17_part2.mp4",
    

    

    desc: `

🔥فلمێ دوبلاجكرى بو زمانئ كوردى-بادينى: venom 3 
🔥
....................................................
کورتیەک:(ئێدی بروک) و (ڤینوم) پێدڤیە بریارەکا ئێک لاکەر بدەن، لدەمێ کو هێزەکا سەربازی و دوژمنەکێ مەزن ب جهێ وان دکەڤن، چارەنڤێسێ مروڤایەتیێ یێ ل دەستێ دوو هەڤالێن گەلەک نێزیک دا.
....................................................
وه لات: ويلايەتێن ئێکگرتی
سال: ٢٠٢٤
دەم : ١٠٤ خولاک
دەرهێنەر: كيلي مارسيل
كواليتى:1080p/HD
دوبلاج: کوردی-بادينى`
},
];

const categories = [
    "هەمی فلم",
    "ئەكشن ",
    "دراما",
    "خێزانى",
    "جەنگ",
    "کۆمیدی",
    "عاشق",
"سەركێشى",
"فانتاسى",
"هەستلڤين",
  "خەیاڵی "   
];